<%@ page language="java" import="java.util.*" pageEncoding="UTF-8"%>
<%@ taglib uri="http://java.sun.com/jsp/jstl/core" prefix="c" %>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<title>免责条款-爱医康医用耗材信息服务平台</title>
<meta http-equiv="keywords" content="1" />
<meta http-equiv="description" content="1" />
<%@ include file="inc.jsp" %>
</head>

<body>
<%@ include file="top.jsp" %>
<div class="screen-width">
	<h2 class="mTop30 mz-title">免责条款</h2>
	<p><b>请您认真阅读并充分理解本协议中各条款，包括免除或者限制爱医康物联网责任的免责条款及对用户的权利限制条款，并选择接受或不接受本协议。如您完成了注册、登录、使用等行为，则将视为对本协议的接受，并同意接受本协议各项条款的约束。本协议由爱医康物联网进行修订，修订后的协议条款经网站公布，即代替原协议条款，用户继 续接受平台服务，即视为已接受了修改后的协议。</b></p>
	<dl class="mz-memo">
		<dt>服务条件</dt>
		<dd>
			用户要使用爱医康物联网提供的服务，须遵守以下约定：<br />
			1、用户要对其发布的信息负责，应提供详尽、真实、准确的企业资料，不得发布不真实的、有歧义、违法国家法律法规等的信息，绝对禁止发布误导性的、恶意的消息，用户不得利用本平台危害国家安全、泄露国家秘密，不得侵犯国家社会集体的和公民的合法权益，不得利用本平台制作和传播侵犯任何第三方权益的信息。如有以上情形发生，爱医康物联网可将相关内容删除或暂停会员服务。<br />
			2、爱医康物联网向用户提供的帐号及密码只供会员使用,如果用户将帐号或密码丢失或被盗，应及时找回或重新登记并重新设置密码。因用户帐号及密码丢失而造成的损失，用户应自行承担责任。<br />
			3、如用户利用提供的服务从事包括但不限于上述列举的违法或侵权行为，给爱医康物联网或任何第三方造成损失的，用户应负责全额赔偿。爱医康物联网保留其给爱医康物联网造成的名誉及财产损失，进行法律起诉的权利。
		</dd>
		<dt>权利及义务</dt>
		<dd>
			本网站上关于爱医康物联网会员的产品（包括但不限于公司名称、联系人及联络信息，产品的描述和说明，相关图片等）的信息均由会员自行提供，会员依法应对其提供的任何信息承担全部责任。爱医康物联网对此等信息的准确性、完整性、合法性或真实性均不承担任何责任。此外，爱医康物联网对任何使用或提供本网站信息的商业活动及其风险不承担任何责任。会员可以下载本网站上显示的资料，但这些资料只限用于正当商业用途，不得用于任何侵权行为，无论是否在资料上明示，所有此等资料都是受到版权法的法律保护。会员没有获得爱医康物联网或各自的版权所有者明确的书面同意下，不得分发、修改、散布、再使用、再传递或使用本网站的内容用于任何公众商业用途。对于因不可抗力或其它无法控制的原因造成的服务中断或其它缺陷，包括由于系统问题导致的有关数据或信息的丢失，爱医康物联网不应承担责任，但将尽可能地处理善后事宜，并努力减少因此而给用户造成的损失和影响。<br />
			爱医康物联网保留对用户提交的内容进行修改、不予发表、删除等权利。<br />
			爱医康物联网保证不对外公开或向第三方提供用户注册资料及用户在使用网络服务时存储在爱医康物联网平台的非公开内容，但可根据如下规定对用户的信息进行披露: <br />
			(a) 根据有关的法律法规要求；<br />
			(b) 执行本服务条款；<br />
			(c) 事先获得用户的明确授权；<br />
			(d) 按照相关政府主管部门的要求；
		</dd>
		<dt>免责声明</dt>
		<dd>
			爱医康物联网在此特别声明对如下事宜不承担任何法律责任：<br />
			（一） 爱医康物联网在此声明，对您使用网站、与本网站相关的任何内容、服务或其它链接至本网站的站点、内容均不作直接、间接、法定、约定的保证。<br />
			（二） 无论在任何原因下（包括但不限于疏忽原因），对您或任何人通过使用本网站上的信息或由本网站链接的信息，或其他与本网站链接的网站信息所导致的损失或损害（包括直接、间接、特别或后果性的损失或损害，例如收入或利润之损失，电脑系统之损坏或数据丢失等后果），责任均由使用者自行承担(包括但不限于疏忽责任)。使用者对本网站的使用即表明同意承担浏览本网站的全部风险，由于爱医康物联网未参与建设、制作或发展本网站或提供内容，对使用者在本网站存取资料所导致的任何直接、相关的、后果性的、间接的或金钱上的损失不承担任何责任。
		</dd>
	</dl>
</div>
 <%@ include file="bottom.jsp" %> 
</body>
</html>